src/DataProcessors/ОбработкаПП/ОбработкаПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаПП</name>
</mdclass:DataProcessor>

src/Documents/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаТранзита</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>АктТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрэкНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСдачиВТК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.УпаковатьЗаказы</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначения</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Упакован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартииТК</name>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ОбработкаПП/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере(ДатаНачала,ДатаОкончания);
КонецПроцедуры


Процедура ВыполнитьКомандуНаСервере(ДатаНачала,ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаТранзитаПокупки.Ссылка
		|ПОМЕСТИТЬ Сбор
		|ИЗ
		|	Документ.ВыдачаТранзита.Покупки КАК ВыдачаТранзитаПокупки
		|ГДЕ
		|	(ВыдачаТранзитаПокупки.СтоимостьХранения <> 0
		|			ИЛИ ВыдачаТранзитаПокупки.Ссылка.СтоимостьХранения <> 0)
		|	И ВыдачаТранзитаПокупки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаТранзитаПокупки.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяПокупки.Ссылка
		|ИЗ
		|	Документ.Расходная.Покупки КАК РасходнаяПокупки
		|ГДЕ
		|	(РасходнаяПокупки.СтоимостьХранения <> 0
		|			ИЛИ РасходнаяПокупки.Ссылка.ПоискНикаСтоимость <> 0
		|			ИЛИ РасходнаяПокупки.Ссылка.СтоимостьИтого <> 0)
		|	И РасходнаяПокупки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяПокупки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сбор.Ссылка
		|ИЗ
		|	Сбор КАК Сбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Сбор.Ссылка.Дата,
		|	Сбор.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.ВыдачаТранзита") Тогда
			об.СтоимостьХранения=0;
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.Расходная") Тогда
			об.СтоимостьИтого=0;
			об.ПоискНикаСтоимость=0;
		КонецЕсли;	
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.Расходная") Тогда
			Для каждого стр из об.Покупки Цикл
				стр.СтоимостьИтого=0;
				стр.СтоимостьДоставки=0;	
				стр.СтоимостьХранения= 0;
			КонецЦикла;
		Иначе
			Для каждого стр из об.Покупки Цикл
				стр.СтоимостьХранения= 0;
			КонецЦикла;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			Попытка
				об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести "+Об);
			КонецПопытки;
		Иначе
			Попытка
				об.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать "+Об);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНачала=НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	ДатаОкончания=КонецМесяца(НачалоМесяца(ТекущаяДата())-1);

КонецПроцедуры
